# 1. Первые шаги, print, input, переменныеы, операции и пр
# 2. if else
# 3. while cycle
# 4. for, list
# 5. многомерные листы
# 6. строковые методы
# 7. кортежи(tuples), множество(set)
# 8. словари dictionaries
# 9. файлы, байты, менеджеры контекста

# advanced, работа с модулями, работа с системами, ООП, работа с классами, 

# структуры данных, алгоритмы
# библиотеки, фреймворки, django 


# n = int(input())

# factorial = 1
# while n > 1:
#     factorial *= n
#     n -= 1

# print(factorial) 